/**
 * [max,min,highlight]组成一套颜色配置
 */

module.exports = {
	MAX_COLORS: ['#B596BC', '#AF54A4', '#30A6C1', '#F08421', '#72BF49', '#F385B7', '#d3405c', '#F9CA06', '#10AD93', '#3c87c8'],
	MIN_COLORS: ['#f7f4f8', '#f7eef6', '#eaf6f9', '#fdf2e8', '#f1f8ec', '#fef3f8', '#fbecee', '#fefae6', '#e7f7f4', '#ebf3f9'],
	HIGHTLIGHT_COLORS: ['#dbb6e3', '#e885dc', '#3fcff0', '#ffb739', '#84de54', '#ff8bdd', '#ff4c6e', '#fff557', '#19daba', '#51afff'],
	PROVINCES: {
		'北京': '北京',
		'北京市': '北京',
		'天津': '天津',
		'天津市': '天津',
		'上海': '上海',
		'上海市': '上海',
		'重庆': '重庆',
		'重庆市': '重庆',
		'河北': '河北',
		'河南': '河南',
		'云南': '云南',
		'辽宁': '辽宁',
		'黑龙江': '黑龙江',
		'湖南': '湖南',
		'安徽': '安徽',
		'山东': '山东',
		'新疆': '新疆',
		'江苏': '江苏',
		'浙江': '浙江',
		'江西': '江西',
		'湖北': '湖北',
		'广西': '广西',
		'甘肃': '甘肃',
		'山西': '山西',
		'内蒙古': '内蒙古',
		'陕西': '陕西',
		'吉林': '吉林',
		'福建': '福建',
		'贵州': '贵州',
		'广东': '广东',
		'青海': '青海',
		'西藏': '西藏',
		'四川': '四川',
		'宁夏': '宁夏',
		'海南': '海南',
		'台湾': '台湾',
		'香港': '香港',
		'澳门': '澳门'
	}
}